<?php

return [
	'title_404'             => 'Сторінка не знайдена',
	'months'				=> [
		'01'	=> 'Січня',
		'02'	=> 'Лютого',
		'03'	=> 'Березня',
		'04'	=> 'Квітня',
		'05'	=> 'Травня',
		'06'	=> 'Червня',
		'07'	=> 'Липня',
		'08'	=> 'Серпня',
		'09'	=> 'Вересня',
		'10'	=> 'Жовтня',
		'11'	=> 'Листопада',
		'12'	=> 'Грудня'
	],
	'year'					=> 'року',
	'cookie'				=> [
		'text'	=> 'Для поліпшення роботи сайту та його взаємодії з користувачами ми використовуємо файли cookie. Продовжуючи роботу з сайтом, Ви дозволяєте використання cookie-файлів. Ви завжди можете відключити файли cookie в налаштуваннях Вашого браузера.',
		'btn'	=> 'Прийняти',
	],
	'cabinet'				=> [
		'index'			=> [
			'title'				=> 'Мій кабінет',
		],
		'contracts'		=> [
			'title'				=> 'Мої договори',
		],
		'bills'			=> [
			'title'				=> 'Мої рахунки',
		],
		'messages'		=> [
			'title'				=> 'Повідомлення',
		],
		'orders'		=> [
			'title'				=> 'Мої замовлення',
		],
		'settings'		=> [
			'title'				=> 'Налаштування',
		],
	],
];
